// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

Console.WriteLine("Введите число:");
int UserNumber = Math.Abs(Convert.ToInt32(Console.ReadLine()));
userNumberLength = UserNumber;

int result = SumNumbers(UserNumber);
Console.WriteLine($"Колличество цифр в числе = {result}");

int SumNumbers(int num)
{
    int Sum = 0;
    while(num>0)
    {
        
        count++;
    }
    return count;
}
for (int i = 0; i < userNumberLength; i++)
{
    num = num + num(i);
}

